aaron-bond.better-comments
abdelaziz18003.quasar-snippets
adpyke.codesnap
anysphere.remote-ssh
be5invis.vscode-custom-css
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
bruno-api-client.bruno
calebporzio.better-phpunit
cardinal90.multi-cursor-case-preserve
christian-kohler.path-intellisense
cjhowe7.laravel-blade
coozieki.php-implementor
ctf0.php-class-imports-folding
ctf0.php-namespace-resolver
dansysanalyst.pest-snippets
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecodes.vscode-phpmd
editorconfig.editorconfig
emmanuelbeziat.vscode-great-icons
esbenp.prettier-vscode
faelv.composer-companion
formulahendry.auto-close-tag
formulahendry.auto-complete-tag
formulahendry.auto-rename-tag
github.github-vscode-theme
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
jaguadoromero.vscode-php-create-class
jkjustjoshing.vscode-text-pastry
junstyle.php-cs-fixer
klesun.deep-assoc-completion-vscode
laravel.vscode-laravel
liamhammett.inline-parameters
m1guelpf.better-pest
mehedidracula.php-constructor
mehedidracula.php-namespace-resolver
mikestead.dotenv
misterj.vue-volar-extention-pack
mohsen1.prettify-json
monokai.theme-monokai-pro-vscode
ms-vscode.remote-repositories
ms-vscode.test-adapter-converter
mykhailokushnir.vscode-php-getter-setter
neilbrayfield.php-docblocker
oderwat.indent-rainbow
onecentlin.laravel-blade
open-southeners.laravel-pint
plustimeit.php-file-refactoring
pranaygp.vscode-css-peek
redhat.vscode-xml
redhat.vscode-yaml
richie5um2.vscode-sort-json
ronvanderheijden.phpdoc-generator
sanderronde.phpstan-vscode
sdras.vue-vscode-snippets
selemondev.shadcn-vue
shufo.vscode-blade-formatter
sibiraj-s.vscode-scss-formatter
sleistner.vscode-fileutils
steoates.autoimport
stivo.tailwind-fold
svipas.control-snippets
swordev.phpstan
syler.sass-indented
tamasfe.even-better-toml
tanemapps.json-to-php-array
tiansin.php-class-helper
trixnz.go-to-method
unifiedjs.vscode-mdx
vue.volar
wayou.vscode-todo-highlight
wix.vscode-import-cost
wmaurer.change-case
wscats.vue
xabikos.javascriptsnippets
xdebug.php-debug
xyc.vscode-mdx-preview
yoavbls.pretty-ts-errors
ziyasal.vscode-open-in-github
