tap "oven-sh/bun"
# Spell checker with better logic than ispell
brew "aspell"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash beautifier
brew "beautysh"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Mozilla CA bundle for Python
brew "certifi"
# Statistics utility to count lines of code
brew "cloc"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Free Pascal: multi-architecture Pascal compiler
brew "fpc"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Ping, but with a graph
brew "gping"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Create, run, and share large language models (LLMs)
brew "ollama"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "pam-reattach"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@17"
# Theme for zsh
brew "powerlevel10k"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Autoformat shell script source code
brew "shfmt"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux", args: ["HEAD"]
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Chromium based browser
cask "arc"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Two-panel file manager
cask "commander-one"
# Write, edit, and chat about your code with AI
cask "cursor"
# Server and cloud storage browser
cask "cyberduck"
# Database version management tool
cask "dbngin"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Emulator for x86 with DOS
cask "dosbox"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
# GIT client
cask "fork"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Laravel and PHP development environment manager
cask "herd"
# Free and open-source media player
cask "iina"
# Open-source, KeePass-client and password manager
cask "macpass"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Free and open-source RSS reader
cask "netnewswire"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open-source transport simulation game
cask "openttd"
# Collaboration platform for API development
cask "postman"
# Debug with Ray to fix problems faster
cask "ray"
# Control your tools with a few keystrokes
cask "raycast"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Create, edit, browse SQLite databases
cask "sqlitestudio"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Native GUI tool for relational databases
cask "tableplus"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Tinker tool for PHP and Laravel developers
cask "tinkerwell"
# Open-source BitTorrent client
cask "transmission"
# File transfer application
cask "transmit"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Connect to Windows
cask "windows-app"
# Multiplayer code editor
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Consent-O-Matic", id: 1606897889
mas "CrystalFetch", id: 6454431289
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Mini Motorways", id: 1456188526
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "SponsorBlock", id: 1573461917
mas "The Unarchiver", id: 425424353
vscode "aaron-bond.better-comments"
vscode "abdelaziz18003.quasar-snippets"
vscode "alefragnani.pascal"
vscode "alefragnani.pascal-formatter"
vscode "be5invis.vscode-custom-css"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bruno-api-client.bruno"
vscode "calebporzio.better-phpunit"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.path-intellisense"
vscode "cjhowe7.laravel-blade"
vscode "coozieki.php-implementor"
vscode "ctf0.php-class-imports-folding"
vscode "ctf0.php-namespace-resolver"
vscode "dansysanalyst.pest-snippets"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "ecodes.vscode-phpmd"
vscode "editorconfig.editorconfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "faelv.composer-companion"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "jaguadoromero.vscode-php-create-class"
vscode "jkjustjoshing.vscode-text-pastry"
vscode "junstyle.php-cs-fixer"
vscode "klesun.deep-assoc-completion-vscode"
vscode "laravel.vscode-laravel"
vscode "liamhammett.inline-parameters"
vscode "m1guelpf.better-pest"
vscode "mehedidracula.php-constructor"
vscode "mehedidracula.php-namespace-resolver"
vscode "mikestead.dotenv"
vscode "misterj.vue-volar-extention-pack"
vscode "mohsen1.prettify-json"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "mykhailokushnir.vscode-php-getter-setter"
vscode "neilbrayfield.php-docblocker"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel-blade"
vscode "open-southeners.laravel-pint"
vscode "plustimeit.php-file-refactoring"
vscode "quicktype.quicktype"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ronvanderheijden.phpdoc-generator"
vscode "sanderronde.phpstan-vscode"
vscode "sdras.vue-vscode-snippets"
vscode "shufo.vscode-blade-formatter"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sleistner.vscode-fileutils"
vscode "steoates.autoimport"
vscode "stivo.tailwind-fold"
vscode "svipas.control-snippets"
vscode "swordev.phpstan"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tanemapps.json-to-php-array"
vscode "tiansin.php-class-helper"
vscode "trixnz.go-to-method"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "wmaurer.change-case"
vscode "wscats.vue"
vscode "xabikos.javascriptsnippets"
vscode "xdebug.php-debug"
vscode "ziyasal.vscode-open-in-github"
